simmsb/tyrfing/vendor/avr-device/svd/avr32dd20.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CLKCTRL</name>
      <description>Clock controller</description>
      <baseAddress>0x00000060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x6</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCLKCTRLA</name>
          <description>MCLK Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCHF</name>
                  <description>Internal high-frequency oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC32K</name>
                  <description>Internal 32.768 kHz oscillator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC32K</name>
                  <description>32.768 kHz crystal oscillator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK</name>
                  <description>External clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUT</name>
              <description>System clock out</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKCTRLB</name>
          <description>MCLK Control B</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PEN</name>
              <description>Prescaler enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PDIV</name>
              <description>Prescaler division</description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2X</name>
                  <description>2X</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4X</name>
                  <description>4X</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8X</name>
                  <description>8X</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X</name>
                  <description>16X</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32X</name>
                  <description>32X</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64X</name>
                  <description>64X</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6X</name>
                  <description>6X</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10X</name>
                  <description>10X</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12X</name>
                  <description>12X</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24X</name>
                  <description>24X</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48X</name>
                  <description>48X</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKCTRLC</name>
          <description>MCLK Control C</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFDEN</name>
              <description>Clock Failure Detect Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CFDTST</name>
              <description>Clock Failure Detect Test</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CFDSRC</name>
              <description>Clock Failure Detect Source</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKMAIN</name>
                  <description>Main Clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSCHF</name>
                  <description>XOSCHF</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC32K</name>
                  <description>XOSC32K</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKINTCTRL</name>
          <description>MCLK Interrupt Control</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFD</name>
              <description>Clock Failure Detect Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTTYPE</name>
              <description>Interrupt type</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Regular Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMI</name>
                  <description>NMI</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKINTFLAGS</name>
          <description>MCLK Interrupt Flags</description>
          <addressOffset>0x4</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFD</name>
              <description>Clock Failure Detect Interrupt Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKSTATUS</name>
          <description>MCLK Status</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SOSC</name>
              <description>System Oscillator changing</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCHFS</name>
              <description>High frequency oscillator status</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OSC32KS</name>
              <description>32KHz oscillator status</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XOSC32KS</name>
              <description>32.768 kHz Crystal Oscillator status</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXTS</name>
              <description>External Clock status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLS</name>
              <description>PLL oscillator status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC32KCTRLA</name>
          <description>OSC32K Control A</description>
          <addressOffset>0x18</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCHFCTRLA</name>
          <description>OSCHF Control A</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AUTOTUNE</name>
              <description>Autotune</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRQSEL</name>
              <description>Frequency select</description>
              <bitRange>[5:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1M</name>
                  <description>1 MHz system clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <description>2 MHz system clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3M</name>
                  <description>3 MHz system clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <description>4 MHz system clock (default)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8M</name>
                  <description>8 MHz system clock</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12M</name>
                  <description>12 MHz system clock</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <description>16 MHz system clock</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>20M</name>
                  <description>20 MHz system clock</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24M</name>
                  <description>24 MHz system clock</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCHFTUNE</name>
          <description>OSCHF Tune</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TUNE</name>
              <description>Tune</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCTRLA</name>
          <description>PLL Control A</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MULFAC</name>
              <description>Multiplication factor</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>PLL is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2x</name>
                  <description>2 x multiplication factor</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3x</name>
                  <description>3 x multiplication factor</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOURCE</name>
              <description>Source</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCHF</name>
                  <description>High frequency internal oscillator as PLL source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSCHF</name>
                  <description>High frequency external clock or external high frequency oscillator as PLL source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32KCTRLA</name>
          <description>XOSC32K Control A</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPMODE</name>
              <description>Low power mode</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL</name>
              <description>Select</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSUT</name>
              <description>Crystal startup time</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1K</name>
                  <description>1k cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16k cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>32k cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64K</name>
                  <description>64k cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSCHFCTRLA</name>
          <description>XOSC HF Control A</description>
          <addressOffset>0x20</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SELHF</name>
              <description>External Source Select</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>External Crystal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLOCK</name>
                  <description>External clock on XTALHF1 pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRQRANGE</name>
              <description>Frequency Range</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8M</name>
                  <description>Max 8 MHz XTAL Frequency</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <description>Max 16 MHz XTAL Frequency</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24M</name>
                  <description>Max 24 MHz XTAL Frequency</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32M</name>
                  <description>Max 32 MHz XTAL Frequency</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSUTHF</name>
              <description>Start-up Time Select</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 XOSCHF cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1K</name>
                  <description>1K XOSCHF cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4K</name>
                  <description>4K XOSCHF cycles</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUNSTBY</name>
              <description>Run Standby</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
