simmsb/tyrfing/vendor/avr-device/svd/avr32dd20.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00001050</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BODCFG</name>
          <description>BOD Configuration</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLEEP</name>
              <description>BOD Operation in Sleep Mode</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>BOD enabled in continuous mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE</name>
                  <description>BOD enabled in sampled mode</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTIVE</name>
              <description>BOD Operation in Active Mode</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>BOD disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>BOD enabled in continuous mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLE</name>
                  <description>BOD enabled in sampled mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLEWAIT</name>
                  <description>BOD enabled in continuous mode. Execution is halted at wake-up until BOD is running.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPFREQ</name>
              <description>BOD Sample Frequency</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>128Hz</name>
                  <description>Sample frequency is 128 Hz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32Hz</name>
                  <description>Sample frequency is 32 Hz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVL</name>
              <description>BOD Level</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BODLEVEL0</name>
                  <description>1.9V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODLEVEL1</name>
                  <description>2.45V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODLEVEL2</name>
                  <description>2.7V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BODLEVEL3</name>
                  <description>2.85V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BOOTSIZE</name>
          <description>Boot Section Size</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>CODESIZE</name>
          <description>Code Section Size</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OSCCFG</name>
          <description>Oscillator Configuration</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Frequency Select</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCHF</name>
                  <description>1-32MHz internal oscillator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC32K</name>
                  <description>32.768kHz internal oscillator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG0</name>
          <description>System Configuration 0</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EESAVE</name>
              <description>EEPROM Save</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTPINCFG</name>
              <description>Reset Pin Configuration</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>GPIO mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST</name>
                  <description>Reset mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPDIPINCFG</name>
              <description>UPDI Pin Configuration</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>GPIO Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI</name>
                  <description>UPDI Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCSEL</name>
              <description>CRC Select</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC16</name>
                  <description>Enable CRC16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC32</name>
                  <description>Enable CRC32</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRCSRC</name>
              <description>CRC Source</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH</name>
                  <description>CRC of full Flash (boot, application code and application data)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT</name>
                  <description>CRC of boot section</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOTAPP</name>
                  <description>CRC of application code and boot sections</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOCRC</name>
                  <description>No CRC</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG1</name>
          <description>System Configuration 1</description>
          <addressOffset>0x6</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUT</name>
              <description>Startup Time</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0MS</name>
                  <description>0 ms</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1MS</name>
                  <description>1 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MS</name>
                  <description>2 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MS</name>
                  <description>4 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8MS</name>
                  <description>8 ms</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16MS</name>
                  <description>16 ms</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32MS</name>
                  <description>32 ms</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64MS</name>
                  <description>64 ms</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MVSYSCFG</name>
              <description>MVIO System Configuration</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DUAL</name>
                  <description>Device used in a dual supply configuration</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Device used in a single supply configuration</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCFG</name>
          <description>Watchdog Configuration</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PERIOD</name>
              <description>Watchdog Timeout Period</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Watch-Dog timer Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (8ms)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (16ms)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (32ms)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (64ms)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (0.128s)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (0.256s)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (0.512s)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (1.0s)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (2.0s)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (4.0s)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (8.0s)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINDOW</name>
              <description>Watchdog Window Timeout Period</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Window mode off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CLK</name>
                  <description>8 cycles (8ms)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16CLK</name>
                  <description>16 cycles (16ms)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32CLK</name>
                  <description>32 cycles (32ms)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64CLK</name>
                  <description>64 cycles (64ms)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128CLK</name>
                  <description>128 cycles (0.128s)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256CLK</name>
                  <description>256 cycles (0.256s)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512CLK</name>
                  <description>512 cycles (0.512s)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1KCLK</name>
                  <description>1K cycles (1.0s)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2KCLK</name>
                  <description>2K cycles (2.0s)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4KCLK</name>
                  <description>4K cycles (4.0s)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8KCLK</name>
                  <description>8K cycles (8.0s)</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
